// General
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon wymaga trzech podstawowych plików. (mówiąc prosto)
boot0 (Na MBR dysku) odpowiedzialne za ładowanie boot1.
boot1 (Na boot-sektorze partycji) za znalezienie boot2.
boot2 (W gównym katalogu partycji) za ładowanie kernela itp.";

"Standard_title" = "Chameleon Standard";
"Standard_description" = "Ta opcja Instaluje trzy podstawowe pliki i zapisuje boot0 na pierwszych 440 bajtach MBR tak, aby nie zniszczyć istniejącego kodu Windows. Następnie boot0 szuka boot1h na pierwszej aktywnej partycji.
* Ta metoda instalacji ustawia zaznaczoną partycję jako aktywną.";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Nic";
"noboot_description" = "Nie instaluj Chameleona (Przydatne podczas instalacji tylko komponentów Extra)";

// Modules

"Module_title" = "Chameleon Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"NVIDIAGraphicsEnabler_title" = "NVIDIAGraphicsEnabler";
"NVIDIAGraphicsEnabler_description" = "";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

// Utility
"Utility_title" = "Narzędzia";
"Utility_description" = "Opcjonalne pliki przydatne w konfiguracji.";

"PrefPanel_title" = "Panel Preferencji";
"PrefPanel_description" = "Instaluje Panel Preferencji dla Chameleona.";

"SMBIOSDefault_title" = "SMBIOS.plist";
"SMBIOSDefault_description" = "Kopiuje domyślne smbios.plist w /Extra/Configuration.";

"Documentation_title" = "Dokumentacja";
"Documentation_description" = "Dokumentacja dla użytkowania i instalacji ręcznej Chameleona.";

// Options
"Options_title" = "Opcje Bootowania";
"Options_description" = "Utwórz /Extra/com.apple.Boot.plist i wybierz swoje żądane opcje by kontrolować ustawienia Chameleona.";

"arch_title" = "arch=i386";
"arch_description" = "Uruchamia kernela w trybie 32 bitowym zamiast domyślnego 64 bitowego.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Wyświetla ekran wyboru partycji od razu, bez pokazywania odliczania.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Włącza cichy tryb uruchamiania (brak komunikatów i potwierdzeń).";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Wyłącza domyślnie włączoną poprawkę restartu.";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Odrzuca wbudowane tablice SSDT płyty głównej.";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "Włącza opcję dodania: 'wbudowany' ('built-in') do twoich urządzeń Ethernetowych.";

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Włącza opcję automatycznego wykrywania GPU NVIDII i umieszczania odpowiednich informacji.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable C2State";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable C3State";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable C4State";

// Advanced
"Advanced_title" = "Zaawansowane Opcje Uruchamiania";
"Advanced_description" = "Utwórz /Extra/com.apple.Boot.plist i wybierz swoje żądane zaawansowane opcje by kontrolować ustawienia Chameleona.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "Set the flag npci=0x2000 for the Kernel Flags";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Ukrywa boot banner Chameleona w GUI.";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Używa oryginalnego logo Apple (szare na białym) w ekranie ładowania, zamiast boot.png.";

"SMBIOSdefaults_title" = "SMBIOSdefaults=Yes";
"SMBIOSdefaults_description" = "Włącza opcję SMBIOSdefaults.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Włącza opcję UseAtiROM.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Włącza opcję UseNvidiaROM.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Wstrzymuje proces uruchamiania. Gdy Chameleon zakończy przygotowanie do uruchomienia kernela, będzie czekał na naciśnięcie klawisza zanim go uruchomi. Przydatne z opcją Verbose do wyszukiwania błędów.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Próbuje wczytać zrzut pamięci (sleep image) zapisany podczas ostatniej hibernacji.";

"GUI_title" = "GUI=No";
"GUI_description" = "Wyłącza domyślnie włączony Graficzny Interfejs Użytkownika.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Włącza opcję VBIOS.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Włącza automatyczne generowanie stanów C-States procesora.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Włącza automatyczne generowanie stanów P-States procesora.";

"CSTUsingSystemIO_title" = "New - Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "Włącza HPET na chipsetach Intela, dla biosów, które nie zawierają tej opcji.";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "Ta opcja pozwala obejść złe zrzuty pamięci hibernacji (sleep images).";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "Włącza opcję naprawy problemów własności EHCI na niepoprawnych biosach.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Włącza opcję resetu kontrolerów UHCI przed uruchomieniem OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Wyłącza domyślnie włączone rozpoznawanie pamięci RAM.";

// Resolution
"Resolution_title" = "Rozdzielczość";
"Resolution_description" = "Ustaw rozdzielczość ekranu dla twojego monitora.";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "1024x768x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "1280x960x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "1920x1200x32";

// Themes
"Themes_title" = "Tematy";
"Themes_description" = "Kolekcja przykładowych tematów graficznych.
Więcej tematów znajdziesz na http://forum.voodooprojects.org/index.php/board,7.0.html";

"Embed_title" = "Embed";
"Embed_description" = "Mniejsza, prosta wersja nowego tematu, domyślnie używana podczas tworzenia wersji Chameleona, który wymaga osadzonych tematów. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Poprzedni domyślny temat Chameleona.";

"Default_title" = "Standard";
"Default_description" = "Nowy domyślny temat Chameleona.";

// Extras
"Extras_title" = "Dodatki";
"Extras_description" = "Kolekcja przydatnych dodatków.";

"SMBios_title" = "Zastąpienie SMBIOS";
"SMBios_description" = "Isntaluje domyślny SMBIOS zastępując smbios.plist w Extra.";

// Error strings
"ERROR_BOOTVOL" = "To oprogramowanie musi być zainstalowane na woluminie startowym.";
"ERROR_INSTALL" = "Ten wolumin nie spełnia wymagań dla tego uaktualnienia.";

"Newer_Package_Installed_message" = "Nowsza wersja Chameleona jest już zainstalowana.";
"Intel_Mac_message" = "To oprogramowanie nie może być zainstalowane na tym komputerze.";
